{"modelTopology": {"node": [{"name": "alex_net/fc_output/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "alex_net/fc_output/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "147456"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "alex_net/flatten/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "alex_net/conv5/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "alex_net/conv5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv4/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "alex_net/conv4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "alex_net/conv1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "96"}]}}}}}, {"name": "resize/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resize/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convert_image/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_tensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_UINT8"}}}, {"name": "convert_image/Cast", "op": "Cast", "input": ["input_tensor"], "attr": {"SrcT": {"type": "DT_UINT8"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "convert_image", "op": "Mul", "input": ["convert_image/Cast", "convert_image/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resize/ExpandDims", "op": "ExpandDims", "input": ["convert_image", "resize/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["resize/ExpandDims", "resize/size"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "resize/Squeeze", "op": "Squeeze", "input": ["resize/ResizeBilinear"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["resize/Squeeze", "resize/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv1/Conv2D", "op": "Conv2D", "input": ["ExpandDims", "alex_net/conv1/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "alex_net/conv1/BiasAdd", "op": "BiasAdd", "input": ["alex_net/conv1/Conv2D", "alex_net/conv1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "alex_net/conv1/Relu", "op": "Relu", "input": ["alex_net/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/pool1/MaxPool", "op": "MaxPool", "input": ["alex_net/conv1/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv2/Conv2D", "op": "Conv2D", "input": ["alex_net/pool1/MaxPool", "alex_net/conv2/kernel"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv2/BiasAdd", "op": "BiasAdd", "input": ["alex_net/conv2/Conv2D", "alex_net/conv2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "alex_net/conv2/Relu", "op": "Relu", "input": ["alex_net/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/pool2/MaxPool", "op": "MaxPool", "input": ["alex_net/conv2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "alex_net/conv3/Conv2D", "op": "Conv2D", "input": ["alex_net/pool2/MaxPool", "alex_net/conv3/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "alex_net/conv3/BiasAdd", "op": "BiasAdd", "input": ["alex_net/conv3/Conv2D", "alex_net/conv3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "alex_net/conv3/Relu", "op": "Relu", "input": ["alex_net/conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv4/Conv2D", "op": "Conv2D", "input": ["alex_net/conv3/Relu", "alex_net/conv4/kernel"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv4/BiasAdd", "op": "BiasAdd", "input": ["alex_net/conv4/Conv2D", "alex_net/conv4/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv4/Relu", "op": "Relu", "input": ["alex_net/conv4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv5/Conv2D", "op": "Conv2D", "input": ["alex_net/conv4/Relu", "alex_net/conv5/kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "alex_net/conv5/BiasAdd", "op": "BiasAdd", "input": ["alex_net/conv5/Conv2D", "alex_net/conv5/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/conv5/Relu", "op": "Relu", "input": ["alex_net/conv5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "alex_net/pool3/MaxPool", "op": "MaxPool", "input": ["alex_net/conv5/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "alex_net/flatten/Reshape", "op": "Reshape", "input": ["alex_net/pool3/MaxPool", "alex_net/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "alex_net/fc_output/MatMul", "op": "MatMul", "input": ["alex_net/flatten/Reshape", "alex_net/fc_output/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "alex_net/fc_output/BiasAdd", "op": "BiasAdd", "input": ["alex_net/fc_output/MatMul", "alex_net/fc_output/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "predictions", "op": "Softmax", "input": ["alex_net/fc_output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of5", "group1-shard2of5", "group1-shard3of5", "group1-shard4of5", "group1-shard5of5"], "weights": [{"name": "alex_net/fc_output/bias", "shape": [8], "dtype": "float32"}, {"name": "alex_net/fc_output/kernel", "shape": [147456, 8], "dtype": "float32"}, {"name": "alex_net/flatten/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "alex_net/conv5/bias", "shape": [256], "dtype": "float32"}, {"name": "alex_net/conv5/kernel", "shape": [3, 3, 384, 256], "dtype": "float32"}, {"name": "alex_net/conv4/bias", "shape": [384], "dtype": "float32"}, {"name": "alex_net/conv4/kernel", "shape": [3, 3, 384, 384], "dtype": "float32"}, {"name": "alex_net/conv3/bias", "shape": [384], "dtype": "float32"}, {"name": "alex_net/conv3/kernel", "shape": [3, 3, 256, 384], "dtype": "float32"}, {"name": "alex_net/conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "alex_net/conv2/kernel", "shape": [3, 3, 96, 256], "dtype": "float32"}, {"name": "alex_net/conv1/bias", "shape": [96], "dtype": "float32"}, {"name": "alex_net/conv1/kernel", "shape": [3, 3, 3, 96], "dtype": "float32"}, {"name": "resize/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "resize/size", "shape": [2], "dtype": "int32"}, {"name": "convert_image/y", "shape": [], "dtype": "float32"}]}]}